{"podcast":{"title":"Be Healthy Naturally","description":"Be Healthy Naturally is all about learning how to increase your health in natural ways. Doctors, Practitioners, Educators bring their expertise as they increase our knowledge on how to increase our health naturally. Our goal is to make natural healthcare the standard and not the alternative.","thumbnailUrl":"https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/site/32633/podcasts/46ede954-3957-499f-9b2a-11fe40a7ffb5.jpg","brandSettings":{"accent_color":"#f8fafb","accent_text_color":"#1F2837","primary_color":"#2e91fc","primary_text_color":"#FFF","font_family":"Open Sans"},"url":"https://www.behealthyutah.com/podcasts/be-healthy-naturally","feedUrl":"https://app.kajabi.com/podcasts/2147485647/feed","locale":"en"},"episode":{"title":"#42 The Controversial Topic of NACET with Mark Webb","episodeNumber":null,"explicit":false,"description":"\u003cp\u003eHave you heard of the controversy over NAC? Many people know it as a very strong anti-oxidant that was pulled off the shelf in the middle of last year because of the benefits it has to help with respiratory issues. Mark Webb talks about a new product coming out called NACET and how this could revolutionize our healing response.\u003c/p\u003e\n\u003cp\u003eMark started his career in the medical research industry working for the Utah Biomedical test laboratory. He has two degrees from the University of Utah and an MBA in Global Management from the University of Phoenix. He got involved with the supplement industry by working for Nutraceutical Corporation as a senior brand manager and then working for a kitchen houseware company where he was over marketing and product development. He has appeared on QVC and much national radio and talk shows. Mark has acted as the Director of global marketing for Unicity International, CMO for Mead labs, and is the founder and CEO of High Energy Labs, a national supplement company. He is currently overseas Marketing and Branding for Nature’s Fusions, in Orem, Utah.\u003c/p\u003e","thumbnailUrl":"https://kajabi-storefronts-production.kajabi-cdn.com/kajabi-storefronts-production/site/32633/podcasts/46ede954-3957-499f-9b2a-11fe40a7ffb5.jpg","publicationDate":"2022-03-30T17:35:00Z","duration":"1982.484969","url":"https://www.behealthyutah.com/podcasts/be-healthy-naturally/episodes/2147710919","media":{"url":"https://app.kajabi.com/podcasts/medias/2147710919.mp3?kjb=true","size":63443615,"type":"audio/mpeg"},"chapters":[]}}